Revit 2026 API

# RepeatingReferenceSourceGetReference Method

---

Returns an individual repeating reference given by coordinates in the array, or  if there is no reference at the coordinates (for example if there is a hole in a divided surface.)

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetReference(
	RepeaterCoordinates coordinates
)
```
```vb
Public Function GetReference (
	coordinates As RepeaterCoordinates
) As Reference
```
```cpp
public:
Reference^ GetReference(
	RepeaterCoordinates^ coordinates
)
```
```fsharp
member GetReference :
        coordinates : RepeaterCoordinates -> Reference
```

#### Parameters

coordinates RepeaterCoordinates
     The coordinates in the array of repeating references.

#### Return Value

Reference The repeating reference.

| Exception | Condition |
| --- | --- |
| ArgumentException | The coordinates are not valid for the repeating reference source. This could be because of a mismatched dimensionality or because the coordinates are outside the bounds of the repeating reference source. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The repeating reference source is no longer valid. |

The coordinates must be within the bounds of the repeating reference source.

#### Reference

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace